In [1]:
import pandas as pd
import numpy as np

In [2]:
#make a dtaframe with 2 dimwtional list 
data = [['1', '2', '3'], ['a', 'b', 'c']]

df = pd.DataFrame(data, columns=["a1", "a2", "a3"])
df

  a1 a2 a3
0  1  2  3
1  a  b  c

In [3]:
#crate a dataframe of dictionary
data = {
    "name" : ['a1', 'a2'],
    "age" : [10, 20]
}

df = pd.DataFrame(data)
df

  name  age
0   a1   10
1   a2   20

In [4]:
#crteate a dataframe using list of lists

data = [['1', "a1"], ['2', 'a2']]
df = pd.DataFrame(data, columns=['r1', 'r2'])
df

  r1  r2
0  1  a1
1  2  a2

In [5]:
#create dataframe from list of lists
data = [(1, 'a1'), (2, 'a2')]
df = pd.DataFrame(data, columns=['r1', 'r2'])
df

   r1  r2
0   1  a1
1   2  a2

In [6]:
#create a dataframe using list of nested dictionary
data = [{
    "name": ['a1', 'a2'],
    "age":[10,20]
},
{
    "name" : ['b1', 'b2'],
    "age" : [30, 40]
}]

d = []
for item in data:
    for name, age in zip(item['name'], item['age']):
        d.append({'name': name, 'age': age})

print(d)
df = pd.DataFrame(d)
df

[{'name': 'a1', 'age': 10}, {'name': 'a2', 'age': 20}, {'name': 'b1', 'age': 30}, {'name': 'b2', 'age': 40}]

  name  age
0   a1   10
1   a2   20
2   b1   30
3   b2   40

In [7]:
#create a dataframe from pandas series
data = pd.Series([1,2,3,4])
df = pd.DataFrame(data, columns=['num'])
df

   num
0    1
1    2
2    3
3    4

In [8]:
#construct a dataframe using string data in pandas
from io import StringIO

data = StringIO("""name;age
                a1;10
                a2;20
                b1;30
                """)

df = pd.read_csv(data, sep=';')
df

                 name  age
0                  a1   10
1                  a2   20
2                  b1   30

In [9]:
#Replace values in Pandas dataframe using regex
data = {
    "name" : ['a1', 'a2'],
    "age" : [10, 20]
}

df = pd.DataFrame(data)

df['name'].str.replace(r'^[a-zA-Z][0-9]+$', 'Alice', regex=True)

0    Alice
1    Alice
Name: name, dtype: object

In [10]:
#CLEAN THE STRING DATA IN DATAFRAME 
df = pd.DataFrame({
    'name' : ['ALIce', 'BOB', '  Charlie'],
    'age' : [25, 30, 35],
    'city' : ['New YorK', '    Los Angeles', 'ChICagO        ']
})
print(df)
df['name'] = df['name'].apply(lambda x: x.strip().capitalize())
df['city'] = df['city'].apply(lambda x: x.strip().capitalize())
df

        name  age             city
0      ALIce   25         New YorK
1        BOB   30      Los Angeles
2    Charlie   35  ChICagO

      name  age         city
0    Alice   25     New york
1      Bob   30  Los angeles
2  Charlie   35      Chicago

In [11]:
#reindexing in pandas dataframe
data = {
    'a': [1,2,3],
    'b' : ['a', 'b', 'c']
}

df = pd.DataFrame(data)
a = df.reindex(['r1', 'r2', 'r3']) 
print(a)
df = pd.DataFrame(data, index=['r1', 'r2', 'r3'])
df

     a    b
r1 NaN  NaN
r2 NaN  NaN
r3 NaN  NaN

    a  b
r1  1  a
r2  2  b
r3  3  c

In [12]:
#maping external values to dataframe
data = {
    'name' : ['Alice', 'Bob', 'Charlie'],
    'age' : [25, 30, 35]
}

df = pd.DataFrame(data)
data2 = {
    'Alice': 'New York',
    'Bob': 'Los Angeles',
    'Charlie': 'Chicago'
}

data3 = {
    'name': ['Alice', 'Bob', 'Charlie'],
    'salary': [50000, 60000, 70000]
}

data3_ = dict(zip(data3['name'], data3['salary']))

df['city'] = df['name'].map(data2)
df['salary'] = df['name'].map(data3_)
df

      name  age         city  salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000

In [13]:
#reshape dataframe using stack, unstack and melt methods
df1 = df.stack()
df1

0  name            Alice
   age                25
   city         New York
   salary          50000
1  name              Bob
   age                30
   city      Los Angeles
   salary          60000
2  name          Charlie
   age                35
   city          Chicago
   salary          70000
dtype: object

In [14]:
df1.unstack()

      name age         city salary
0    Alice  25     New York  50000
1      Bob  30  Los Angeles  60000
2  Charlie  35      Chicago  70000

In [15]:
df1 = pd.DataFrame({
    'Name': ['Alice', 'Bob'],
    'Math': [90, 85],
    'Science': [95, 80]
})

pd.melt(df1, id_vars=['Name'], var_name='sub', value_name='score')

    Name      sub  score
0  Alice     Math     90
1    Bob     Math     85
2  Alice  Science     95
3    Bob  Science     80

In [16]:
#reset index in pandas dataframe
df.index= ['row1', 'row2', 'row3']
df.reset_index(inplace=True)
df

  index     name  age         city  salary
0  row1    Alice   25     New York   50000
1  row2      Bob   30  Los Angeles   60000
2  row3  Charlie   35      Chicago   70000

In [21]:
#channge column name and raw index in pandas dataframe
df.index = ['row1', 'row2', 'row3']
df.rename(columns={'name': 'NAME', 'age': 'AGE'},inplace=True)
df.rename(index={'row1' :'r1','row2' : 'r2','row3' :'r3'},inplace=True)
df

   index     NAME  AGE         city  salary
r1  row1    Alice   25     New York   50000
r2  row2      Bob   30  Los Angeles   60000
r3  row3  Charlie   35      Chicago   70000

In [ ]:
#iterate over rows in pandas dataframe
for i, row in df.iterrows():
    print(f"row index :{i}, name: {row['NAME']}, 'age': {row['AGE']}")
print("\nUsing itertuples:")
for row in df.itertuples():
    print(f"index: {row.index}, name: {row.NAME}, age: {row.AGE}")

row index :r1, name: Alice, 'age': 25
row index :r2, name: Bob, 'age': 30
row index :r3, name: Charlie, 'age': 35

Using itertuples:
index: row1, name: Alice, age: 25
index: row2, name: Bob, age: 30
index: row3, name: Charlie, age: 35

In [26]:
#select rowes based on condition in pandas dataframe
df[df['AGE']>25]

   index     NAME  AGE         city  salary
r2  row2      Bob   30  Los Angeles   60000
r3  row3  Charlie   35      Chicago   70000

In [31]:
#select row using iloc[] and iat[] methods
#diffree3nt between both is that iloc can take multiple rows and columns while iat can take only single row and column
print(df.iloc[0:2, 1])  
print(df.iloc[1,1])
df.iat[1,1]

r1    Alice
r2      Bob
Name: NAME, dtype: object
Bob

'Bob'